Revit 2026 API

# ConnectorManager Properties

---

The ConnectorManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Connectors | Return all the Connectors of the Connector Manager. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Owner | This property is used to retrieve the owner of the Connector Manager. |
|  | UnusedConnectors | Return all the unused Connectors of the Connector Manager. |

#### Reference

ConnectorManager Class

Autodesk.Revit.DB Namespace